'use strict';

/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up (queryInterface, Sequelize) {
    /**
     * Add seed commands here.
     *
     * Example:
     * await queryInterface.bulkInsert('People', [{
     *   name: 'John Doe',
     *   isBetaMember: false
     * }], {});
    */

    await queryInterface.bulkInsert('countries', countries, {});
  },

  async down (queryInterface, Sequelize) {
    await queryInterface.bulkDelete('countries', null, {});
    /**
     * Add commands to revert seed here.
     *
     * Example:
     * await queryInterface.bulkDelete('People', null, {});
     */
  }
};

var countries = [
  {
    "id": 528,
    "code": "AU",
    "name": "Австралия",
  },
  {
    "id": 537,
    "code": "AT",
    "name": "Австрийская Республика",
  },
  {
    "id": 625,
    "code": "DZ",
    "name": "Алжирская Народная Демократическая Республика",
  },
  {
    "id": 523,
    "code": "AS",
    "name": "Американское Самоа",
  },
  {
    "id": 680,
    "code": "AI",
    "name": "Ангилья",
  },
  {
    "id": 526,
    "code": "AG",
    "name": "Антигуа и Барбуда",
  },
  {
    "id": 642,
    "code": "EG",
    "name": "Арабская Республика Египет",
  },
  {
    "id": 538,
    "code": "AR",
    "name": "Аргентинская Республика",
  },
  {
    "id": 713,
    "code": "AW",
    "name": "Аруба",
  },
  {
    "id": 531,
    "code": "BB",
    "name": "Барбадос",
  },
  {
    "id": 546,
    "code": "BZ",
    "name": "Белиз",
  },
  {
    "id": 532,
    "code": "BM",
    "name": "Бермуды",
  },
  {
    "id": 634,
    "code": "VE",
    "name": "Боливарийская Республика Венесуэла",
  },
  {
    "id": 542,
    "code": "BA",
    "name": "Босния и Герцеговина",
  },
  {
    "id": 552,
    "code": "VG",
    "name": "Британские Виргинские острова",
  },
  {
    "id": 551,
    "code": "BN",
    "name": "Бруней-Даруссалам",
  },
  {
    "id": 637,
    "code": "BF",
    "name": "Буркина-Фасо",
  },
  {
    "id": 735,
    "code": "LU",
    "name": "Великое Герцогство Люксембург",
  },
  {
    "id": 572,
    "code": "HU",
    "name": "Венгерская Республика",
  },
  {
    "id": 638,
    "code": "VI",
    "name": "Виргинские острова Соединенных Штатов",
  },
  {
    "id": 636,
    "code": "UY",
    "name": "Восточная Республика Уругвай",
  },
  {
    "id": 759,
    "code": "CON",
    "name": "В соответствии с условиями контрактов (договоров)",
  },
  {
    "id": 590,
    "code": "GA",
    "name": "Габонская Республика",
  },
  {
    "id": 580,
    "code": "GP",
    "name": "Гваделупа",
  },
  {
    "id": 577,
    "code": "GN",
    "name": "Гвинейская Республика",
  },
  {
    "id": 585,
    "code": "GI",
    "name": "Гибралтар",
  },
  {
    "id": 754,
    "code": "IL",
    "name": "Государство Израиль",
  },
  {
    "id": 687,
    "code": "QA",
    "name": "Государство Катар",
  },
  {
    "id": 745,
    "code": "KW",
    "name": "Государство Кувейт",
  },
  {
    "id": 581,
    "code": "GD",
    "name": "Гренада",
  },
  {
    "id": 582,
    "code": "GL",
    "name": "Гренландия",
  },
  {
    "id": 583,
    "code": "GR",
    "name": "Греческая Республика",
  },
  {
    "id": 589,
    "code": "GE",
    "name": "Грузия",
  },
  {
    "id": 629,
    "code": "GU",
    "name": "Гуам",
  },
  {
    "id": 619,
    "code": "CD",
    "name": "Демократическая Республика Конго",
  },
  {
    "id": 676,
    "code": "ST",
    "name": "Демократическая Республика Сан-Томе и Принсипи",
  },
  {
    "id": 689,
    "code": "TL",
    "name": "Демократическая Республика Тимор-Лесте",
  },
  {
    "id": 613,
    "code": "LK",
    "name": "Демократическая Социалистическая Республика Шри-Ланка",
  },
  {
    "id": 604,
    "code": "DO",
    "name": "Доминиканская Республика",
  },
  {
    "id": 627,
    "code": "EU",
    "name": "Европейский Союз",
  },
  {
    "id": 662,
    "code": "EH",
    "name": "Западная Сахара",
  },
  {
    "id": 749,
    "code": "JO",
    "name": "Иорданское Хашимитское Королевство",
  },
  {
    "id": 755,
    "code": "IE",
    "name": "Ирландия",
  },
  {
    "id": 757,
    "code": "IR",
    "name": "Исламская Республика Иран",
  },
  {
    "id": 742,
    "code": "MR",
    "name": "Исламская Республика Мавритания",
  },
  {
    "id": 699,
    "code": "PK",
    "name": "Исламская Республика Пакистан",
  },
  {
    "id": 753,
    "code": "IT",
    "name": "Итальянская Республика",
  },
  {
    "id": 631,
    "code": "YE",
    "name": "Йеменская Республика",
  },
  {
    "id": 555,
    "code": "CA",
    "name": "Канада",
  },
  {
    "id": 556,
    "code": "CN",
    "name": "Китайская Народная Республика",
  },
  {
    "id": 524,
    "code": "AD",
    "name": "Княжество Андорра",
  },
  {
    "id": 737,
    "code": "LI",
    "name": "Княжество Лихтенштейн",
  },
  {
    "id": 723,
    "code": "MC",
    "name": "Княжество Монако",
  },
  {
    "id": 747,
    "code": "KP",
    "name": "Корейская Народно-Демократическая Республика",
  },
  {
    "id": 536,
    "code": "BH",
    "name": "Королевство Бахрейн",
  },
  {
    "id": 534,
    "code": "BE",
    "name": "Королевство Бельгии",
  },
  {
    "id": 533,
    "code": "BT",
    "name": "Королевство Бутан",
  },
  {
    "id": 606,
    "code": "DK",
    "name": "Королевство Дания",
  },
  {
    "id": 663,
    "code": "ES",
    "name": "Королевство Испания",
  },
  {
    "id": 615,
    "code": "KH",
    "name": "Королевство Камбоджа",
  },
  {
    "id": 741,
    "code": "LS",
    "name": "Королевство Лесото",
  },
  {
    "id": 719,
    "code": "MA",
    "name": "Королевство Марокко",
  },
  {
    "id": 622,
    "code": "NP",
    "name": "Королевство Непал",
  },
  {
    "id": 714,
    "code": "NL",
    "name": "Королевство Нидерландов",
  },
  {
    "id": 704,
    "code": "NO",
    "name": "Королевство Норвегия",
  },
  {
    "id": 675,
    "code": "SA",
    "name": "Королевство Саудовская Аравия",
  },
  {
    "id": 660,
    "code": "SZ",
    "name": "Королевство Свазиленд",
  },
  {
    "id": 655,
    "code": "TH",
    "name": "Королевство Таиланд",
  },
  {
    "id": 654,
    "code": "TO",
    "name": "Королевство Тонга",
  },
  {
    "id": 659,
    "code": "SE",
    "name": "Королевство Швеция",
  },
  {
    "id": 519,
    "code": "KG",
    "name": "Кыргызская Республика",
  },
  {
    "id": 744,
    "code": "LA",
    "name": "Лаосская Народно-Демократическая Республика",
  },
  {
    "id": 740,
    "code": "LV",
    "name": "Латвийская Республика",
  },
  {
    "id": 743,
    "code": "LB",
    "name": "Ливанская Республика",
  },
  {
    "id": 736,
    "code": "LT",
    "name": "Литовская Республика",
  },
  {
    "id": 609,
    "code": "YT",
    "name": "Майотта",
  },
  {
    "id": 731,
    "code": "MY",
    "name": "Малайзия",
  },
  {
    "id": 730,
    "code": "MV",
    "name": "Мальдивская Республика",
  },
  {
    "id": 727,
    "code": "MQ",
    "name": "Мартиника",
  },
  {
    "id": 724,
    "code": "MX",
    "name": "Мексиканские Соединенные Штаты",
  },
  {
    "id": 541,
    "code": "BO",
    "name": "Многонациональное Государство Боливия",
  },
  {
    "id": 722,
    "code": "MN",
    "name": "Монголия",
  },
  {
    "id": 720,
    "code": "MS",
    "name": "Монтсеррат",
  },
  {
    "id": 527,
    "code": "BD",
    "name": "Народная Республика Бангладеш",
  },
  {
    "id": 632,
    "code": "WS",
    "name": "Независимое Государство Самоа",
  },
  {
    "id": 479,
    "code": "UN",
    "name": "Неизвестна",
  },
  {
    "id": 616,
    "code": "AN",
    "name": "Нидерландские Антильские острова",
  },
  {
    "id": 710,
    "code": "NZ",
    "name": "Новая Зеландия",
  },
  {
    "id": 712,
    "code": "NC",
    "name": "Новая Каледония",
  },
  {
    "id": 639,
    "code": "TZ",
    "name": "Объединенная Республика Танзания",
  },
  {
    "id": 650,
    "code": "AE",
    "name": "Объединенные Арабские Эмираты",
  },
  {
    "id": 617,
    "code": "PS",
    "name": "Оккупированная Палестинская территория",
  },
  {
    "id": 614,
    "code": "KY",
    "name": "Острова Кайман",
  },
  {
    "id": 567,
    "code": "CK",
    "name": "Острова Кука",
  },
  {
    "id": 647,
    "code": "TC",
    "name": "Острова Теркс и Кайкос",
  },
  {
    "id": 630,
    "code": "GG",
    "name": "Остров Гернси",
  },
  {
    "id": 628,
    "code": "JE",
    "name": "Остров Джерси",
  },
  {
    "id": 640,
    "code": "IM",
    "name": "Остров Мэн",
  },
  {
    "id": 705,
    "code": "NF",
    "name": "Остров Норфолк",
  },
  {
    "id": 569,
    "code": "VA",
    "name": "Папский Престол (Государство — город Ватикан)",
  },
  {
    "id": 697,
    "code": "PG",
    "name": "Папуа-Новая Гвинея",
  },
  {
    "id": 540,
    "code": "AF",
    "name": "Переходное Исламское Государство Афганистан",
  },
  {
    "id": 693,
    "code": "PN",
    "name": "Питкэрн",
  },
  {
    "id": 691,
    "code": "PT",
    "name": "Португальская Республика",
  },
  {
    "id": 688,
    "code": "PR",
    "name": "Пуэрто-Рико",
  },
  {
    "id": 248,
    "code": "DI",
    "name": "Разные",
  },
  {
    "id": 595,
    "code": "FJ",
    "name": "Республика Oстровов Фиджи",
  },
  {
    "id": 539,
    "code": "AZ",
    "name": "Республика Азербайджан",
  },
  {
    "id": 624,
    "code": "AL",
    "name": "Республика Албания",
  },
  {
    "id": 525,
    "code": "AO",
    "name": "Республика Ангола",
  },
  {
    "id": 530,
    "code": "AM",
    "name": "Республика Армения",
  },
  {
    "id": 544,
    "code": "BY",
    "name": "Республика Беларусь",
  },
  {
    "id": 607,
    "code": "BJ",
    "name": "Республика Бенин",
  },
  {
    "id": 550,
    "code": "BG",
    "name": "Республика Болгария",
  },
  {
    "id": 543,
    "code": "BW",
    "name": "Республика Ботсвана",
  },
  {
    "id": 549,
    "code": "BI",
    "name": "Республика Бурунди",
  },
  {
    "id": 711,
    "code": "VU",
    "name": "Республика Вануату",
  },
  {
    "id": 575,
    "code": "HT",
    "name": "Республика Гаити",
  },
  {
    "id": 576,
    "code": "GY",
    "name": "Республика Гайана",
  },
  {
    "id": 588,
    "code": "GM",
    "name": "Республика Гамбия",
  },
  {
    "id": 586,
    "code": "GH",
    "name": "Республика Гана",
  },
  {
    "id": 578,
    "code": "GT",
    "name": "Республика Гватемала",
  },
  {
    "id": 690,
    "code": "GW",
    "name": "Республика Гвинея-Бисау",
  },
  {
    "id": 574,
    "code": "HN",
    "name": "Республика Гондурас",
  },
  {
    "id": 591,
    "code": "DJ",
    "name": "Республика Джибути",
  },
  {
    "id": 623,
    "code": "ZM",
    "name": "Республика Замбия",
  },
  {
    "id": 664,
    "code": "ZW",
    "name": "Республика Зимбабве",
  },
  {
    "id": 620,
    "code": "IN",
    "name": "Республика Индия",
  },
  {
    "id": 758,
    "code": "ID",
    "name": "Республика Индонезия",
  },
  {
    "id": 756,
    "code": "IQ",
    "name": "Республика Ирак",
  },
  {
    "id": 571,
    "code": "IS",
    "name": "Республика Исландия",
  },
  {
    "id": 557,
    "code": "CV",
    "name": "Республика Кабо-Верде",
  },
  {
    "id": 520,
    "code": "KZ",
    "name": "Республика Казахстан",
  },
  {
    "id": 553,
    "code": "CM",
    "name": "Республика Камерун",
  },
  {
    "id": 748,
    "code": "KE",
    "name": "Республика Кения",
  },
  {
    "id": 568,
    "code": "CY",
    "name": "Республика Кипр",
  },
  {
    "id": 584,
    "code": "KI",
    "name": "Республика Кирибати",
  },
  {
    "id": 560,
    "code": "CO",
    "name": "Республика Колумбия",
  },
  {
    "id": 563,
    "code": "CG",
    "name": "Республика Конго",
  },
  {
    "id": 746,
    "code": "KR",
    "name": "Республика Корея",
  },
  {
    "id": 792,
    "code": "KV",
    "name": "Республика Косово",
  },
  {
    "id": 565,
    "code": "CR",
    "name": "Республика Коста-Рика",
  },
  {
    "id": 752,
    "code": "CI",
    "name": "Республика Кот д'Ивуар",
  },
  {
    "id": 564,
    "code": "CU",
    "name": "Республика Куба",
  },
  {
    "id": 739,
    "code": "LR",
    "name": "Республика Либерия",
  },
  {
    "id": 725,
    "code": "MU",
    "name": "Республика Маврикий",
  },
  {
    "id": 733,
    "code": "MG",
    "name": "Республика Мадагаскар",
  },
  {
    "id": 643,
    "code": "MK",
    "name": "Республика Македония",
  },
  {
    "id": 732,
    "code": "MW",
    "name": "Республика Малави",
  },
  {
    "id": 729,
    "code": "ML",
    "name": "Республика Мали",
  },
  {
    "id": 728,
    "code": "MT",
    "name": "Республика Мальта",
  },
  {
    "id": 701,
    "code": "MH",
    "name": "Республика Маршалловы острова",
  },
  {
    "id": 718,
    "code": "MZ",
    "name": "Республика Мозамбик",
  },
  {
    "id": 721,
    "code": "MD",
    "name": "Республика Молдова",
  },
  {
    "id": 716,
    "code": "NA",
    "name": "Республика Намибия",
  },
  {
    "id": 715,
    "code": "NR",
    "name": "Республика Науру",
  },
  {
    "id": 708,
    "code": "NE",
    "name": "Республика Нигер",
  },
  {
    "id": 709,
    "code": "NI",
    "name": "Республика Никарагуа",
  },
  {
    "id": 706,
    "code": "NU",
    "name": "Республика Ниуэ",
  },
  {
    "id": 700,
    "code": "PW",
    "name": "Республика Палау",
  },
  {
    "id": 698,
    "code": "PA",
    "name": "Республика Панама",
  },
  {
    "id": 696,
    "code": "PY",
    "name": "Республика Парагвай",
  },
  {
    "id": 695,
    "code": "PE",
    "name": "Республика Перу",
  },
  {
    "id": 692,
    "code": "PL",
    "name": "Республика Польша",
  },
  {
    "id": 726,
    "code": "SM",
    "name": "Республика Сан-Марино",
  },
  {
    "id": 673,
    "code": "SC",
    "name": "Республика Сейшелы",
  },
  {
    "id": 674,
    "code": "SN",
    "name": "Республика Сенегал",
  },
  {
    "id": 626,
    "code": "RS",
    "name": "Республика Сербия",
  },
  {
    "id": 671,
    "code": "SG",
    "name": "Республика Сингапур",
  },
  {
    "id": 667,
    "code": "SI",
    "name": "Республика Словения",
  },
  {
    "id": 621,
    "code": "SD",
    "name": "Республика Судан",
  },
  {
    "id": 669,
    "code": "SR",
    "name": "Республика Суринам",
  },
  {
    "id": 672,
    "code": "SL",
    "name": "Республика Сьерра-Леоне",
  },
  {
    "id": 656,
    "code": "TJ",
    "name": "Республика Таджикистан",
  },
  {
    "id": 651,
    "code": "TT",
    "name": "Республика Тринидад и Тобаго",
  },
  {
    "id": 645,
    "code": "UG",
    "name": "Республика Уганда",
  },
  {
    "id": 635,
    "code": "UZ",
    "name": "Республика Узбекистан",
  },
  {
    "id": 694,
    "code": "PH",
    "name": "Республика Филиппины",
  },
  {
    "id": 608,
    "code": "HR",
    "name": "Республика Хорватия",
  },
  {
    "id": 612,
    "code": "TD",
    "name": "Республика Чад",
  },
  {
    "id": 521,
    "code": "ME",
    "name": "Республика Черногория",
  },
  {
    "id": 559,
    "code": "CL",
    "name": "Республика Чили",
  },
  {
    "id": 603,
    "code": "EC",
    "name": "Республика Эквадор",
  },
  {
    "id": 601,
    "code": "GQ",
    "name": "Республика Экваториальная Гвинея",
  },
  {
    "id": 602,
    "code": "SV",
    "name": "Республика Эль-Сальвадор",
  },
  {
    "id": 686,
    "code": "RE",
    "name": "Реюньон",
  },
  {
    "id": 684,
    "code": "RU",
    "name": "Российская Федерация",
  },
  {
    "id": 683,
    "code": "RW",
    "name": "Руандийская Республика",
  },
  {
    "id": 685,
    "code": "RO",
    "name": "Румыния",
  },
  {
    "id": 682,
    "code": "SH",
    "name": "Святая Елена, Остров вознесения, Тристан-да-Кунья",
  },
  {
    "id": 677,
    "code": "VC",
    "name": "Сент-Винсент и Гренадины",
  },
  {
    "id": 681,
    "code": "KN",
    "name": "Сент-Китс и Невис",
  },
  {
    "id": 679,
    "code": "LC",
    "name": "Сент-Люсия",
  },
  {
    "id": 678,
    "code": "PM",
    "name": "Сент-Пьер и Микелон",
  },
  {
    "id": 657,
    "code": "SY",
    "name": "Сирийская Арабская Республика",
  },
  {
    "id": 670,
    "code": "SK",
    "name": "Словацкая Республика",
  },
  {
    "id": 547,
    "code": "BS",
    "name": "Содружество Багамы",
  },
  {
    "id": 605,
    "code": "DM",
    "name": "Содружество Доминики",
  },
  {
    "id": 703,
    "code": "MP",
    "name": "Содружество Северных Марианских островов",
  },
  {
    "id": 641,
    "code": "GB",
    "name": "Соединенное Королевство Великобритании и Северной Ирландии",
  },
  {
    "id": 485,
    "code": "US",
    "name": "Соединенные Штаты Америки",
  },
  {
    "id": 548,
    "code": "SB",
    "name": "Соломоновы Острова",
  },
  {
    "id": 666,
    "code": "SO",
    "name": "Сомалийская Республика",
  },
  {
    "id": 738,
    "code": "LY",
    "name": "Социалистическая Народная Ливийская Арабская Джамахирия",
  },
  {
    "id": 668,
    "code": "VN",
    "name": "Социалистическая Республика Вьетнам",
  },
  {
    "id": 610,
    "code": "KM",
    "name": "Союз Коморы",
  },
  {
    "id": 554,
    "code": "MM",
    "name": "Союз Мьянма",
  },
  {
    "id": 573,
    "code": "HK",
    "name": "Специальный административный регион Китая Гонконг",
  },
  {
    "id": 734,
    "code": "MO",
    "name": "Специальный административный регион Китая Макао",
  },
  {
    "id": 717,
    "code": "OM",
    "name": "Султанат Оман",
  },
  {
    "id": 611,
    "code": "TW",
    "name": "Тайвань (Китай)",
  },
  {
    "id": 653,
    "code": "TG",
    "name": "Тоголезская Республика",
  },
  {
    "id": 652,
    "code": "TK",
    "name": "Токелау",
  },
  {
    "id": 646,
    "code": "TV",
    "name": "Тувалу",
  },
  {
    "id": 649,
    "code": "TN",
    "name": "Тунисская Республика",
  },
  {
    "id": 529,
    "code": "TR",
    "name": "Турецкая Республика",
  },
  {
    "id": 648,
    "code": "TM",
    "name": "Туркменистан",
  },
  {
    "id": 644,
    "code": "UA",
    "name": "Украина",
  },
  {
    "id": 633,
    "code": "WF",
    "name": "Уоллис и Футуна",
  },
  {
    "id": 597,
    "code": "FO",
    "name": "Фарерские Oстрова",
  },
  {
    "id": 600,
    "code": "ET",
    "name": "Федеративная Демократическая Республика Эфиопия",
  },
  {
    "id": 545,
    "code": "BR",
    "name": "Федеративная Республика Бразилия",
  },
  {
    "id": 587,
    "code": "DE",
    "name": "Федеративная Республика Германия",
  },
  {
    "id": 707,
    "code": "NG",
    "name": "Федеративная Республика Нигерия",
  },
  {
    "id": 702,
    "code": "FM",
    "name": "Федеративные штаты Микронезии",
  },
  {
    "id": 594,
    "code": "FI",
    "name": "Финляндская Республика",
  },
  {
    "id": 596,
    "code": "FK",
    "name": "Фолклендские острова (Мальвинские)",
  },
  {
    "id": 592,
    "code": "GF",
    "name": "Французская Гвиана",
  },
  {
    "id": 618,
    "code": "PF",
    "name": "Французская Полинезия",
  },
  {
    "id": 593,
    "code": "FR",
    "name": "Французская Республика",
  },
  {
    "id": 558,
    "code": "CF",
    "name": "Центрально-Африканская Республика",
  },
  {
    "id": 566,
    "code": "CZ",
    "name": "Чешская Республика",
  },
  {
    "id": 658,
    "code": "CH",
    "name": "Швейцарская Конфедерация",
  },
  {
    "id": 661,
    "code": "SJ",
    "name": "Шпицберген и Ян Майен",
  },
  {
    "id": 570,
    "code": "AX",
    "name": "Эландские острова",
  },
  {
    "id": 599,
    "code": "ER",
    "name": "Эритрея",
  },
  {
    "id": 598,
    "code": "EE",
    "name": "Эстонская Республика",
  },
  {
    "id": 665,
    "code": "ZA",
    "name": "Южно-Африканская Республика",
  },
  {
    "id": 751,
    "code": "JM",
    "name": "Ямайка",
  },
  {
    "id": 750,
    "code": "JP",
    "name": "Япония",
  }
]
